{
    "categories": {
        "0": "technical",
        "1": "productivity",
        "2": "data (things)",
        "3": "media",
        "4": "mobile"
    },
    "demo_page": "https://littlelambdas.com/printmagic",
    "description": "Using deep CSS techniques \"Print Magic\" sends any HTML snippet that can be placed into a DIV tag straight to the browser print dialog without using IFRAMEs, popups, or new browser tabs.\n\nNew addition, a paper thin wrapper around the client-side Print.js library from Crabbly, written by Rodrigo Vieira. This plugin also provides a re-factored interface to Julius Koenig's download element, that removes the dependence on Element Ids and conforms more tightly to Bubble's action-state-event pattern.\n\n* iOS and macOS  caveat emptor: AirPrint resolves viewport units to the dimensions of the browser window NOT the physical dimensions of the printed media. The safest way to work with AirPrint is to specify the physical dimensions of the width and height, in millimetres.\n\n* iOS and macOS caveat emptor: On these systems FireFox blocks all attempts to raise the print dialog. In which case this action will simply not work.\n\n* Open source caveat emptor: You can try understanding this code base. However at just under 300 lines of JS this plugin is packed full of subtle and nuanced CSS, HTML, and JS methods, and \"just barely\" works as is.",
    "image": "//s3.amazonaws.com/appforest_uf/f1640214910600x668043787262043500/Lambda_lc.svg",
    "license": "open_source",
    "link": "https://printjs.crabbly.com/",
    "name": "Print Magic",
    "plugin_instructions": "The \"Print Magic\" plugin contains only one client side action, \"Print Magic\", which accepts the following fields:\n\n\"CSS Selectors\" a list of style selector queries. Each item is treated as a single query placed inside a STYLE element. Use this to customize the printed rendering.\n\n\"HTML Pages\" a list of static HTML snippets that can be embedded into a DIV element. Each item in the list is printed on at least one independent page.\n\n\"Copies\" the number of copies of the pages to print. This creates actual copies of the pages. It does not forward a copy count to the print dialog.\n\n\"Margin\" the physical margin of the page, in millimetres, to request from the print manager. May or may not be respected by the print manager.\n\n\"Width\" and \"Height\" must be specified together to be applied. Constrains the physical size of each HTML snippet item in millimetres, regardless of the available physical print media.\n\n\"Orientation\" applies the orientation to each HTML snippet item, regardless of the print manager settings. When \"Width\" and \"Height\" are not supplied uses the viewport units to determine shortest and longest dimensions. See the caveat emptor regarding AirPrint shortcomings.\n\nDrag the Print.js Client element onto the page to access the following actions:\n\n\"Download\" the binary of a remote URL into local memory and provide a local URL pointing to the local file. Will raise \"Download Started\", \"Download Progressed\", and \"Download Completed\" events.\n\n\"Save\" a local URL, raising the Share prompt when available, falling back to the Save file prompt, which in turn falls back to opening the local URL in a new tab.\n\n\"Print\" a PDF or image from a URL, or a HTML or serialized JSON text directly. Will raise the \"Print Started\", Print Completed\", and \"Print Prompt Exited\" events (may or may not be raised depending on browser).\n\n\"Close\" a local file URL, freeing the memory resources.\n\nAll actions, in the case of an error will raise the \"Action Failed\" event.",
    "sa_node_version": 18
}